chgpalmer/nrf9151-tracker/apps/gnss/src/main.c
	/* Best-effort parse of the quoted operator name and key numeric fields. */
	(void)sscanf(resp,
		"%%XMONITOR: %*d,\"%31[^\"]\",%*[^,],%*[^,],%*[^,],%*d,%d,\"%15[^\"]\",%*d,%*d,%d,%d",
		op, &band, cell, &rsrp, &snr);

	printf("LTE:  %s", reg_status_str(reg));
	if (op[0]) {
		printf(" | op %s", op);
	}
	if (band) {
		printf(" | band %d", band);
	}
	if (cell[0]) {
		printf(" | cell %s", cell);
	}
	if (rsrp != 255) {
		printf(" | RSRP %d dBm", rsrp - 140);
	}
	if (snr != 127) {
		printf(" | SNR %d dB", snr - 24);
	}
	printf("\n");
}

int main(void)
{
	int err;
	struct nrf_modem_gnss_nmea_data_frame *nmea_data;

	LOG_INF("Starting GNSS sample");

	err = nrf_modem_lib_init();
	if (err) {
		LOG_ERR("Modem library initialization failed, error: %d", err);
		return err;
	}

	/* Initialize reference coordinates (if used). */
	if (sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE) > 1 &&
	    sizeof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE) > 1) {
		ref_used = true;
		ref_latitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LATITUDE);
		ref_longitude = atof(CONFIG_GNSS_SAMPLE_REFERENCE_LONGITUDE);
	}

	if (modem_init() != 0) {
		LOG_ERR("Failed to initialize modem");
		return -1;
	}

	if (sample_init() != 0) {
		LOG_ERR("Failed to initialize sample");
		return -1;
	}

	if (gnss_init_and_start() != 0) {
		LOG_ERR("Failed to initialize and start GNSS");
		return -1;
	}

	fix_timestamp = k_uptime_get();

	for (;;) {
		(void)k_poll(events, 2, K_FOREVER);

		if (events[0].state == K_POLL_STATE_SEM_AVAILABLE &&
		    k_sem_take(events[0].sem, K_NO_WAIT) == 0) {
			/* New PVT data available */

			if (IS_ENABLED(CONFIG_GNSS_SAMPLE_MODE_TTFF_TEST)) {
				/* TTFF test mode. */

				/* Calculate the time GNSS has been blocked by LTE. */
				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_DEADLINE_MISSED) {
					time_blocked++;
				}
			} else if (IS_ENABLED(CONFIG_GNSS_SAMPLE_NMEA_ONLY)) {
				/* NMEA-only output mode. */

				if (output_paused()) {
					goto handle_nmea;
				}

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
					print_distance_from_reference(&last_pvt);
				}
			} else {
				/* Combined GNSS + LTE status block.
				 * PVT events arrive ~1 Hz; throttle the block so the
				 * console stays readable and we don't hammer the modem
				 * with AT commands. No screen clearing -- output scrolls
				 * so it works over a plain serial capture.
				 */
				if (output_paused()) {
					goto handle_nmea;
				}

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
					fix_timestamp = k_uptime_get();
				}

				if (k_uptime_get() - last_status_print < STATUS_PRINT_INTERVAL_MS) {
					goto handle_nmea;
				}
				last_status_print = k_uptime_get();

				printf("===== status @ %us =====\n",
				       (uint32_t)(k_uptime_get() / 1000));
				print_lte_status();
				print_satellite_stats(&last_pvt);
				print_flags(&last_pvt);

				if (last_pvt.flags & NRF_MODEM_GNSS_PVT_FLAG_FIX_VALID) {
					printf("GNSS: FIX  %.06f, %.06f  alt %.01fm  acc %.01fm\n",
					       last_pvt.latitude, last_pvt.longitude,
					       (double)last_pvt.altitude,
					       (double)last_pvt.accuracy);
					print_distance_from_reference(&last_pvt);
				} else {
					printf("GNSS: searching, %us since last fix\n",
					       (uint32_t)((k_uptime_get() - fix_timestamp) / 1000));
				}
			}
		}

handle_nmea:
		/* Drain the NMEA queue so it doesn't fill and stall GNSS events.
		 * We summarize GNSS in the status block, so don't print raw NMEA.
		 */
		if (events[1].state == K_POLL_STATE_MSGQ_DATA_AVAILABLE &&
		    k_msgq_get(events[1].msgq, &nmea_data, K_NO_WAIT) == 0) {
			k_free(nmea_data);
		}

		events[0].state = K_POLL_STATE_NOT_READY;
		events[1].state = K_POLL_STATE_NOT_READY;
	}

	return 0;
}
